const chalk = require('chalk')
const fs = require('fs')

global.allmenu = (prefix, hituet) => {
return`°•°___✘『 𝗢𝗪𝗡𝗘𝗥-𝗠𝗘𝗡𝗨 』✘___°•°
╭━━━━━━━━━━━━━━━━━━━━━━⦁
┃🐼 *CYBER_PANDA_MD* 🐼
╰━━━━━━━━━━━━━━━━━━━━━━⦁
💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.self*
⚜️𝗗.𝗖.𝗧 ➠ *තමන් සදහා පමනක් බොට් වැඩ කිරිම සදහා...* 
🐼𝗨𝗦𝗘 ➠ .self 

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗  ➠ *.public*
⚜️𝗗.𝗖.𝗧 ➠ *සියලු දෙනාටම බොට් බාවිතා කිරිම සදහා...*
🐼𝗨𝗦𝗘 ➠ .public 

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.join*
⚜️𝗗.𝗖.𝗧 ➠ *සමූහයකට එක් විම සදහා*
🐼𝗨𝗦𝗘 ➠ .join

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.addsticker*
⚜️𝗗.𝗖.𝗧 ➠ *ස්ටිකර් ඇඩ් කිරිම සදහා.*
🐼𝗨𝗦𝗘 ➠.addsticker

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ .delsticker
⚜️𝗗.𝗖.𝗧 ➠ *ස්ටිකර් ඩිලෙට් කිරිම සදහා*
🐼𝗨𝗦𝗘 ➠.delsticker

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.addimage*
⚜️𝗗.𝗖.𝗧 ➠ *ජායා රුපයක් එක් කිරිම සදහා*
🐼𝗨𝗦𝗘 ➠ .addimage

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.block*
⚜️𝗗.𝗖.𝗧 ➠ *ඉන්බොක්ස් පැමිනෙන අය බ්ලොක් කිරිම සදහා*
🐼𝗨𝗦𝗘 ➠ .block

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.delimage* 
⚜️𝗗.𝗖.𝗧 ➠ *ජායා රුපය අයින් කිරිම සහදා*
🐼𝗨𝗦𝗘 ➠ .delimage

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.addvideo*
⚜️𝗗.𝗖.𝗧 ➠ *විඩියොවක් එක් කිරිම සදහා*
🐼𝗨𝗦𝗘 ➠ .addvideo

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.delvideo*
⚜️𝗗.𝗖.𝗧 ➠ *විඩියොව ඩිලෙට් කිරිම සදහා* 
🐼𝗨𝗦𝗘 ➠ .delvideo

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗  ➠ *unblock del*
⚜️𝗗.𝗖.𝗧 ➠ *අන්බ්ලොක් කර ඩිලෙට් කිරිම සදහා *
🐼𝗨𝗦𝗘 ➠ .unblock del

=======================

°•°___✘『 𝗚𝗥𝗢𝗨𝗣-𝗠𝗘𝗡𝗨 』✘___°•°
╭━━━━━━━━━━━━━━━━━━━━━━⦁
┃🐼 *CYBER_PANA_MD* 🐼
╰━━━━━━━━━━━━━━━━━━━━━━⦁
💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.add*
⚜️𝗗.𝗖.𝗧 ➠ *සමූහයට පුද්ගලයන් එකතුකරගැනීම සදහා...* 
🐼𝗨𝗦𝗘 ➠ .add *<number>*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗  ➠ *.delete*
⚜️𝗗.𝗖.𝗧 ➠ *දැමූ මැසේජයක් මකාදැමීම සදහා...*
🐼𝗨𝗦𝗘 ➠ .delete *<tag massage>*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.infogp*
⚜️𝗗.𝗖.𝗧 ➠ *සමූහයේ තොරතුරු ලබාගැනීම සදහා...*
🐼𝗨𝗦𝗘 ➠ .infogp

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.hidetag*
⚜️𝗗.𝗖.𝗧 ➠ *සමූහයේ පුද්ගලයන් hide method ලෙස ටැග් කිරීමට...*
🐼𝗨𝗦𝗘 ➠.hidetag *<massage>*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ .invite
⚜️𝗗.𝗖.𝗧 ➠ *සමූහයට සම්බන්දවන ලෙස ආරාදනා කිරීමට...*
🐼𝗨𝗦𝗘 ➠.invite <94xxxx>

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.kick*
⚜️𝗗.𝗖.𝗧 ➠ *පුද්ගලයකු සමූහයෙන් නෙරපා හැරීම සදහා...*
🐼𝗨𝗦𝗘 ➠ .kick <tag user>

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.link*
⚜️𝗗.𝗖.𝗧 ➠ *සමූහ සබැදිය ලබාගැනීම සදහා...*
🐼𝗨𝗦𝗘 ➠ .link

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.group* 
⚜️𝗗.𝗖.𝗧 ➠ *සමූහය විවෘත්ත කිරීම සදහා...*
🐼𝗨𝗦𝗘 ➠ .group 

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.tagall*
⚜️𝗗.𝗖.𝗧 ➠ *සමූහයේ පුද්ගලයන් සියල්ල ටැග් කිරීමට...*
🐼𝗨𝗦𝗘 ➠ .tagall 

============================


°•°___✘『 𝗗𝗢𝗪𝗡𝗟𝗢𝗔𝗗-𝗠𝗘𝗡𝗨 』✘___°•°
╭━━━━━━━━━━━━━━━━━━━━━━⦁
┃🐼 *CYBER_PANDA_MD* 🐼
╰━━━━━━━━━━━━━━━━━━━━━━⦁
💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.ytsearch*
⚜️𝗗.𝗖.𝗧 ➠ *youtiub තුල සොයා බැලිම සදහා* 

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗  ➠ *.play*
⚜️𝗗.𝗖.𝗧 ➠ *ගිත ඉල්ලිම සදහා*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.ytmp3*
⚜️𝗗.𝗖.𝗧 ➠ *youtiub තුල ඇති ගිත සෙවිම සදහා*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.ytmp4*
⚜️𝗗.𝗖.𝗧 ➠ *youtiub තුල ඇති විඩියො සෙවිම් සදහා *

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ .google
⚜️𝗗.𝗖.𝗧 ➠ *ගුගල් තුලින් සච් කිරිම.*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.spotify*
⚜️𝗗.𝗖.𝗧 ➠ *spotify තුල ඇති ගිත ගැනිම සදහා..*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.fbvid*
⚜️𝗗.𝗖.𝗧 ➠ *FB විඩියො ඩවුන්ලොඩ් කිරිම් සදහා*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.gdrive* 
⚜️𝗗.𝗖.𝗧 ➠ *gdrive ඩවුන්ලොඩ් කිරීම සදහා...*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.ringtone*
⚜️𝗗.𝗖.𝗧 ➠ *ringtone ඩවුන්ලොඩ් කිරිම සදහා.*

============================

°•°___✘『 𝗢𝗧𝗛𝗘𝗥-𝗠𝗘𝗡𝗨 』✘___°•°
╭━━━━━━━━━━━━━━━━━━━━━━⦁
┃🐼 *CYBER_BOT_DEMONS_TEAM* 🐼
╰━━━━━━━━━━━━━━━━━━━━━━⦁
💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.ping*
⚜️𝗗.𝗖.𝗧 ➠ *බොට් රන් වු වෙලාව දැන ගැනිම සදහා..*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.menu*
⚜️𝗗.𝗖.𝗧 ➠ *බොට් කමාන්ඩ් දැන ගැනිම සදහා*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.owner* 
⚜️𝗗.𝗖.𝗧 ➠ *ඔනවර් පිලිබද දැන ගැනිම සදහා.*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.runtime*
⚜️𝗗.𝗖.𝗧 ➠ *බොට් ක්‍රියා කල වෙලාව දැන ගැනිමට.*`}



global.ownermenu = (prefix) => {
return `

°•°___✘『 𝗢𝗪𝗡𝗘𝗥-𝗠𝗘𝗡𝗨 』✘___°•°
╭━━━━━━━━━━━━━━━━━━━━━━⦁
┃🐼 *CYBER_PANDA_MD* 🐼
╰━━━━━━━━━━━━━━━━━━━━━━⦁
💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.self*
⚜️𝗗.𝗖.𝗧 ➠ *තමන් සදහා පමනක් බොට් වැඩ කිරිම සදහා...* 
🐼𝗨𝗦𝗘 ➠ .self 

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗  ➠ *.public*
⚜️𝗗.𝗖.𝗧 ➠ *සියලු දෙනාටම බොට් බාවිතා කිරිම සදහා...*
🐼𝗨𝗦𝗘 ➠ .public 

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.join*
⚜️𝗗.𝗖.𝗧 ➠ *සමූහයකට එක් විම සදහා*
🐼𝗨𝗦𝗘 ➠ .join

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.addsticker*
⚜️𝗗.𝗖.𝗧 ➠ *ස්ටිකර් ඇඩ් කිරිම සදහා.*
🐼𝗨𝗦𝗘 ➠.addsticker

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ .delsticker
⚜️𝗗.𝗖.𝗧 ➠ *ස්ටිකර් ඩිලෙට් කිරිම සදහා*
🐼𝗨𝗦𝗘 ➠.delsticker

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.addimage*
⚜️𝗗.𝗖.𝗧 ➠ *ජායා රුපයක් එක් කිරිම සදහා*
🐼𝗨𝗦𝗘 ➠ .addimage

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.block*
⚜️𝗗.𝗖.𝗧 ➠ *ඉන්බොක්ස් පැමිනෙන අය බ්ලොක් කිරිම සදහා*
🐼𝗨𝗦𝗘 ➠ .block

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.delimage* 
⚜️𝗗.𝗖.𝗧 ➠ *ජායා රුපය අයින් කිරිම සහදා*
🐼𝗨𝗦𝗘 ➠ .delimage

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.addvideo*
⚜️𝗗.𝗖.𝗧 ➠ *විඩියොවක් එක් කිරිම සදහා*
🐼𝗨𝗦𝗘 ➠ .addvideo

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.delvideo*
⚜️𝗗.𝗖.𝗧 ➠ *විඩියොව ඩිලෙට් කිරිම සදහා* 
🐼𝗨𝗦𝗘 ➠ .delvideo

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗  ➠ *unblock del*
⚜️𝗗.𝗖.𝗧 ➠ *අන්බ්ලොක් කර ඩිලෙට් කිරිම සදහා *
🐼𝗨𝗦𝗘 ➠ .unblock del

=======================`}


global.othermenu = (prefix) => {
return `°•°___✘『 𝗢𝗧𝗛𝗘𝗥-𝗠𝗘𝗡𝗨 』✘___°•°
╭━━━━━━━━━━━━━━━━━━━━━━⦁
┃🐼 *CYBER_BOT_DEMONS_TEAM* 🐼
╰━━━━━━━━━━━━━━━━━━━━━━⦁
💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.ping*
⚜️𝗗.𝗖.𝗧 ➠ *බොට් රන් වු වෙලාව දැන ගැනිම සදහා..*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.menu*
⚜️𝗗.𝗖.𝗧 ➠ *බොට් කමාන්ඩ් දැන ගැනිම සදහා*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.owner* 
⚜️𝗗.𝗖.𝗧 ➠ *ඔනවර් පිලිබද දැන ගැනිම සදහා.*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.runtime*
⚜️𝗗.𝗖.𝗧 ➠ *බොට් ක්‍රියා කල වෙලාව දැන ගැනිමට.*`}


global.downloadmenu = (prefix) => {
return `°•°___✘『 𝗗𝗢𝗪𝗡𝗟𝗢𝗔𝗗-𝗠𝗘𝗡𝗨 』✘___°•°
╭━━━━━━━━━━━━━━━━━━━━━━⦁
┃🐼 *CYBER_PANDA_MD* 🐼
╰━━━━━━━━━━━━━━━━━━━━━━⦁
💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.ytsearch*
⚜️𝗗.𝗖.𝗧 ➠ *youtiub තුල සොයා බැලිම සදහා* 

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗  ➠ *.play*
⚜️𝗗.𝗖.𝗧 ➠ *ගිත ඉල්ලිම සදහා*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.ytmp3*
⚜️𝗗.𝗖.𝗧 ➠ *youtiub තුල ඇති ගිත සෙවිම සදහා*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.ytmp4*
⚜️𝗗.𝗖.𝗧 ➠ *youtiub තුල ඇති විඩියො සෙවිම් සදහා *

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ .google
⚜️𝗗.𝗖.𝗧 ➠ *ගුගල් තුලින් සච් කිරිම.*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.spotify*
⚜️𝗗.𝗖.𝗧 ➠ *spotify තුල ඇති ගිත ගැනිම සදහා..*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.fbvid*
⚜️𝗗.𝗖.𝗧 ➠ *FB විඩියො ඩවුන්ලොඩ් කිරිම් සදහා*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.gdrive* 
⚜️𝗗.𝗖.𝗧 ➠ *gdrive ඩවුන්ලොඩ් කිරීම සදහා...*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.ringtone*
⚜️𝗗.𝗖.𝗧 ➠ *ringtone ඩවුන්ලොඩ් කිරිම සදහා.*
============================`}

global.groupmenu = (prefix) => {
return `°•°___✘『 𝗚𝗥𝗢𝗨𝗣-𝗠𝗘𝗡𝗨 』✘___°•°
╭━━━━━━━━━━━━━━━━━━━━━━⦁
┃🐼 *CYBER_PANA_MD* 🐼
╰━━━━━━━━━━━━━━━━━━━━━━⦁
💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.add*
⚜️𝗗.𝗖.𝗧 ➠ *සමූහයට පුද්ගලයන් එකතුකරගැනීම සදහා...* 
🐼𝗨𝗦𝗘 ➠ .add *<number>*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗  ➠ *.delete*
⚜️𝗗.𝗖.𝗧 ➠ *දැමූ මැසේජයක් මකාදැමීම සදහා...*
🐼𝗨𝗦𝗘 ➠ .delete *<tag massage>*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.infogp*
⚜️𝗗.𝗖.𝗧 ➠ *සමූහයේ තොරතුරු ලබාගැනීම සදහා...*
🐼𝗨𝗦𝗘 ➠ .infogp

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.hidetag*
⚜️𝗗.𝗖.𝗧 ➠ *සමූහයේ පුද්ගලයන් hide method ලෙස ටැග් කිරීමට...*
🐼𝗨𝗦𝗘 ➠.hidetag *<massage>*

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ .invite
⚜️𝗗.𝗖.𝗧 ➠ *සමූහයට සම්බන්දවන ලෙස ආරාදනා කිරීමට...*
🐼𝗨𝗦𝗘 ➠.invite <94xxxx>

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.kick*
⚜️𝗗.𝗖.𝗧 ➠ *පුද්ගලයකු සමූහයෙන් නෙරපා හැරීම සදහා...*
🐼𝗨𝗦𝗘 ➠ .kick <tag user>

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.link*
⚜️𝗗.𝗖.𝗧 ➠ *සමූහ සබැදිය ලබාගැනීම සදහා...*
🐼𝗨𝗦𝗘 ➠ .link

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.group* 
⚜️𝗗.𝗖.𝗧 ➠ *සමූහය විවෘත්ත කිරීම සදහා...*
🐼𝗨𝗦𝗘 ➠ .group 

💭𝗖𝗢𝗠𝗠𝗔𝗡𝗗 ➠ *.tagall*
⚜️𝗗.𝗖.𝗧 ➠ *සමූහයේ පුද්ගලයන් සියල්ල ටැග් කිරීමට...*
🐼𝗨𝗦𝗘 ➠ .tagall 
============================`}
let file = require.resolve(__filename)
fs.watchFile(file, () => {
	fs.unwatchFile(file)
	console.log(chalk.redBright(`Update ${__filename}`))
	delete require.cache[file]
	require(file)
})
