const chalk = require('chalk')
const fs = require('fs')

global.allmenu = (prefix, hituet) => {
return`°•°___✘『 𝗢𝗪𝗡𝗘𝗥-𝗠𝗘𝗡𝗨 』✘___°•°
╭━━━━━━━━━━━━━━━━━━━━━━⦁
┃🐼 *CYBER_PANDA_MD* 🐼
╰━━━━━━━━━━━━━━━━━━━━━━⦁
✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.self*
🪀𝗖.𝗫.𝗦 ➠ *තමන් සදහා පමනක් බොට් වැඩ කිරිම සදහා...* 
🐼𝗨𝗦𝗘 ➠ .self 

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖  ➠ *.public*
🪀𝗖.𝗫.𝗦 ➠ *සියලු දෙනාටම බොට් බාවිතා කිරිම සදහා...*
🐼𝗨𝗦𝗘 ➠ .public 

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.join*
🪀𝗖.𝗫.𝗦 ➠ *සමූහයකට එක් විම සදහා*
🐼𝗨𝗦𝗘 ➠ .join

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.addsticker*
🪀𝗖.𝗫.𝗦 ➠ *ස්ටිකර් ඇඩ් කිරිම සදහා.*
🐼𝗨𝗦𝗘 ➠.addsticker

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ .delsticker
🪀𝗖.𝗫.𝗦 ➠ *ස්ටිකර් ඩිලෙට් කිරිම සදහා*
🐼𝗨𝗦𝗘 ➠.delsticker

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.addimage*
🪀𝗖.𝗫.𝗦 ➠ *ජායා රුපයක් එක් කිරිම සදහා*
🐼𝗨𝗦𝗘 ➠ .addimage

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.block*
🪀𝗖.𝗫.𝗦 ➠ *ඉන්බොක්ස් පැමිනෙන අය බ්ලොක් කිරිම සදහා*
🐼𝗨𝗦𝗘 ➠ .block

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.delimage* 
🪀𝗖.𝗫.𝗦 ➠ *ජායා රුපය අයින් කිරිම සහදා*
🐼𝗨𝗦𝗘 ➠ .delimage

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.addvideo*
🪀𝗖.𝗫.𝗦 ➠ *විඩියොවක් එක් කිරිම සදහා*
🐼𝗨𝗦𝗘 ➠ .addvideo

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.delvideo*
🪀𝗖.𝗫.𝗦 ➠ *විඩියොව ඩිලෙට් කිරිම සදහා* 
🐼𝗨𝗦𝗘 ➠ .delvideo

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖  ➠ *unblock del*
🪀𝗖.𝗫.𝗦 ➠ *අන්බ්ලොක් කර ඩිලෙට් කිරිම සදහා *
🐼𝗨𝗦𝗘 ➠ .unblock del

=======================

°•°___✘『 𝗚𝗥𝗢𝗨𝗣-𝗠𝗘𝗡𝗨 』✘___°•°
╭━━━━━━━━━━━━━━━━━━━━━━⦁
┃🐼 *CYBER_PANA_MD* 🐼
╰━━━━━━━━━━━━━━━━━━━━━━⦁
✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.add*
🪀𝗖.𝗫.𝗦 ➠ *සමූහයට පුද්ගලයන් එකතුකරගැනීම සදහා...* 
🐼𝗨𝗦𝗘 ➠ .add *<number>*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖  ➠ *.delete*
🪀𝗖.𝗫.𝗦 ➠ *දැමූ මැසේජයක් මකාදැමීම සදහා...*
🐼𝗨𝗦𝗘 ➠ .delete *<tag massage>*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.infogp*
🪀𝗖.𝗫.𝗦 ➠ *සමූහයේ තොරතුරු ලබාගැනීම සදහා...*
🐼𝗨𝗦𝗘 ➠ .infogp

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.hidetag*
🪀𝗖.𝗫.𝗦 ➠ *සමූහයේ පුද්ගලයන් hide method ලෙස ටැග් කිරීමට...*
🐼𝗨𝗦𝗘 ➠.hidetag *<massage>*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ .invite
🪀𝗖.𝗫.𝗦 ➠ *සමූහයට සම්බන්දවන ලෙස ආරාදනා කිරීමට...*
🐼𝗨𝗦𝗘 ➠.invite <94xxxx>

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.kick*
🪀𝗖.𝗫.𝗦 ➠ *පුද්ගලයකු සමූහයෙන් නෙරපා හැරීම සදහා...*
🐼𝗨𝗦𝗘 ➠ .kick <tag user>

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.link*
🪀𝗖.𝗫.𝗦 ➠ *සමූහ සබැදිය ලබාගැනීම සදහා...*
🐼𝗨𝗦𝗘 ➠ .link

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.group* 
🪀𝗖.𝗫.𝗦 ➠ *සමූහය විවෘත්ත කිරීම සදහා...*
🐼𝗨𝗦𝗘 ➠ .group 

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.tagall*
🪀𝗖.𝗫.𝗦 ➠ *සමූහයේ පුද්ගලයන් සියල්ල ටැග් කිරීමට...*
🐼𝗨𝗦𝗘 ➠ .tagall 

============================


°•°___✘『 𝗖𝗢𝗪𝗡𝗟𝗢𝗔𝗖-𝗠𝗘𝗡𝗨 』✘___°•°
╭━━━━━━━━━━━━━━━━━━━━━━⦁
┃🐼 *CYBER_PANDA_MD* 🐼
╰━━━━━━━━━━━━━━━━━━━━━━⦁
✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.ytsearch*
🪀𝗖.𝗫.𝗦 ➠ *youtiub තුල සොයා බැලිම සදහා* 

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖  ➠ *.play*
🪀𝗖.𝗫.𝗦 ➠ *ගිත ඉල්ලිම සදහා*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.ytmp3*
🪀𝗖.𝗫.𝗦 ➠ *youtiub තුල ඇති ගිත සෙවිම සදහා*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.ytmp4*
🪀𝗖.𝗫.𝗦 ➠ *youtiub තුල ඇති විඩියො සෙවිම් සදහා *

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ .google
🪀𝗖.𝗫.𝗦 ➠ *ගුගල් තුලින් සච් කිරිම.*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.spotify*
🪀𝗖.𝗫.𝗦 ➠ *spotify තුල ඇති ගිත ගැනිම සදහා..*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.fbvid*
🪀𝗖.𝗫.𝗦 ➠ *FB විඩියො ඩවුන්ලොඩ් කිරිම් සදහා*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.gdrive* 
🪀𝗖.𝗫.𝗦 ➠ *gdrive ඩවුන්ලොඩ් කිරීම සදහා...*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.ringtone*
🪀𝗖.𝗫.𝗦 ➠ *ringtone ඩවුන්ලොඩ් කිරිම සදහා.*

============================

°•°___✘『 𝗢𝗦𝗛𝗘𝗥-𝗠𝗘𝗡𝗨 』✘___°•°
╭━━━━━━━━━━━━━━━━━━━━━━⦁
┃🐼 *CYBER_BOT_DEMONS_TEAM* 🐼
╰━━━━━━━━━━━━━━━━━━━━━━⦁
✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.ping*
🪀𝗖.𝗫.𝗦 ➠ *බොට් රන් වු වෙලාව දැන ගැනිම සදහා..*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.menu*
🪀𝗖.𝗫.𝗦 ➠ *බොට් කමාන්ඩ් දැන ගැනිම සදහා*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.owner* 
🪀𝗖.𝗫.𝗦 ➠ *ඔනවර් පිලිබද දැන ගැනිම සදහා.*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.runtime*
🪀𝗖.𝗫.𝗦 ➠ *බොට් ක්‍රියා කල වෙලාව දැන ගැනිමට.*`}



global.ownermenu = (prefix) => {
return `

°•°___✘『 𝗢𝗪𝗡𝗘𝗥-𝗠𝗘𝗡𝗨 』✘___°•°
╭━━━━━━━━━━━━━━━━━━━━━━⦁
┃🐼 *CYBER_PANDA_MD* 🐼
╰━━━━━━━━━━━━━━━━━━━━━━⦁
✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.self*
🪀𝗖.𝗫.𝗦 ➠ *තමන් සදහා පමනක් බොට් වැඩ කිරිම සදහා...* 
🐼𝗨𝗦𝗘 ➠ .self 

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖  ➠ *.public*
🪀𝗖.𝗫.𝗦 ➠ *සියලු දෙනාටම බොට් බාවිතා කිරිම සදහා...*
🐼𝗨𝗦𝗘 ➠ .public 

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.join*
🪀𝗖.𝗫.𝗦 ➠ *සමූහයකට එක් විම සදහා*
🐼𝗨𝗦𝗘 ➠ .join

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.addsticker*
🪀𝗖.𝗫.𝗦 ➠ *ස්ටිකර් ඇඩ් කිරිම සදහා.*
🐼𝗨𝗦𝗘 ➠.addsticker

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ .delsticker
🪀𝗖.𝗫.𝗦 ➠ *ස්ටිකර් ඩිලෙට් කිරිම සදහා*
🐼𝗨𝗦𝗘 ➠.delsticker

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.addimage*
🪀𝗖.𝗫.𝗦 ➠ *ජායා රුපයක් එක් කිරිම සදහා*
🐼𝗨𝗦𝗘 ➠ .addimage

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.block*
🪀𝗖.𝗫.𝗦 ➠ *ඉන්බොක්ස් පැමිනෙන අය බ්ලොක් කිරිම සදහා*
🐼𝗨𝗦𝗘 ➠ .block

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.delimage* 
🪀𝗖.𝗫.𝗦 ➠ *ජායා රුපය අයින් කිරිම සහදා*
🐼𝗨𝗦𝗘 ➠ .delimage

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.addvideo*
🪀𝗖.𝗫.𝗦 ➠ *විඩියොවක් එක් කිරිම සදහා*
🐼𝗨𝗦𝗘 ➠ .addvideo

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.delvideo*
🪀𝗖.𝗫.𝗦 ➠ *විඩියොව ඩිලෙට් කිරිම සදහා* 
🐼𝗨𝗦𝗘 ➠ .delvideo

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖  ➠ *unblock del*
🪀𝗖.𝗫.𝗦 ➠ *අන්බ්ලොක් කර ඩිලෙට් කිරිම සදහා *
🐼𝗨𝗦𝗘 ➠ .unblock del

=======================`}


global.othermenu = (prefix) => {
return `°•°___✘『 𝗢𝗦𝗛𝗘𝗥-𝗠𝗘𝗡𝗨 』✘___°•°
╭━━━━━━━━━━━━━━━━━━━━━━⦁
┃🐼 *CYBER_BOT_DEMONS_TEAM* 🐼
╰━━━━━━━━━━━━━━━━━━━━━━⦁
✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.ping*
🪀𝗖.𝗫.𝗦 ➠ *බොට් රන් වු වෙලාව දැන ගැනිම සදහා..*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.menu*
🪀𝗖.𝗫.𝗦 ➠ *බොට් කමාන්ඩ් දැන ගැනිම සදහා*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.owner* 
🪀𝗖.𝗫.𝗦 ➠ *ඔනවර් පිලිබද දැන ගැනිම සදහා.*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.runtime*
🪀𝗖.𝗫.𝗦 ➠ *බොට් ක්‍රියා කල වෙලාව දැන ගැනිමට.*`}


global.downloadmenu = (prefix) => {
return `°•°___✘『 𝗖𝗢𝗪𝗡𝗟𝗢𝗔𝗖-𝗠𝗘𝗡𝗨 』✘___°•°
╭━━━━━━━━━━━━━━━━━━━━━━⦁
┃🐼 *CYBER_PANDA_MD* 🐼
╰━━━━━━━━━━━━━━━━━━━━━━⦁
✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.ytsearch*
🪀𝗖.𝗫.𝗦 ➠ *youtiub තුල සොයා බැලිම සදහා* 

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖  ➠ *.play*
🪀𝗖.𝗫.𝗦 ➠ *ගිත ඉල්ලිම සදහා*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.ytmp3*
🪀𝗖.𝗫.𝗦 ➠ *youtiub තුල ඇති ගිත සෙවිම සදහා*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.ytmp4*
🪀𝗖.𝗫.𝗦 ➠ *youtiub තුල ඇති විඩියො සෙවිම් සදහා *

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ .google
🪀𝗖.𝗫.𝗦 ➠ *ගුගල් තුලින් සච් කිරිම.*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.spotify*
🪀𝗖.𝗫.𝗦 ➠ *spotify තුල ඇති ගිත ගැනිම සදහා..*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.fbvid*
🪀𝗖.𝗫.𝗦 ➠ *FB විඩියො ඩවුන්ලොඩ් කිරිම් සදහා*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.gdrive* 
🪀𝗖.𝗫.𝗦 ➠ *gdrive ඩවුන්ලොඩ් කිරීම සදහා...*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.ringtone*
🪀𝗖.𝗫.𝗦 ➠ *ringtone ඩවුන්ලොඩ් කිරිම සදහා.*
============================`}

global.groupmenu = (prefix) => {
return `°•°___✘『 𝗚𝗥𝗢𝗨𝗣-𝗠𝗘𝗡𝗨 』✘___°•°
╭━━━━━━━━━━━━━━━━━━━━━━⦁
┃🐼 *CYBER_PANA_MD* 🐼
╰━━━━━━━━━━━━━━━━━━━━━━⦁
✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.add*
🪀𝗖.𝗫.𝗦 ➠ *සමූහයට පුද්ගලයන් එකතුකරගැනීම සදහා...* 
🐼𝗨𝗦𝗘 ➠ .add *<number>*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖  ➠ *.delete*
🪀𝗖.𝗫.𝗦 ➠ *දැමූ මැසේජයක් මකාදැමීම සදහා...*
🐼𝗨𝗦𝗘 ➠ .delete *<tag massage>*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.infogp*
🪀𝗖.𝗫.𝗦 ➠ *සමූහයේ තොරතුරු ලබාගැනීම සදහා...*
🐼𝗨𝗦𝗘 ➠ .infogp

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.hidetag*
🪀𝗖.𝗫.𝗦 ➠ *සමූහයේ පුද්ගලයන් hide method ලෙස ටැග් කිරීමට...*
🐼𝗨𝗦𝗘 ➠.hidetag *<massage>*

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ .invite
🪀𝗖.𝗫.𝗦 ➠ *සමූහයට සම්බන්දවන ලෙස ආරාදනා කිරීමට...*
🐼𝗨𝗦𝗘 ➠.invite <94xxxx>

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.kick*
🪀𝗖.𝗫.𝗦 ➠ *පුද්ගලයකු සමූහයෙන් නෙරපා හැරීම සදහා...*
🐼𝗨𝗦𝗘 ➠ .kick <tag user>

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.link*
🪀𝗖.𝗫.𝗦 ➠ *සමූහ සබැදිය ලබාගැනීම සදහා...*
🐼𝗨𝗦𝗘 ➠ .link

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.group* 
🪀𝗖.𝗫.𝗦 ➠ *සමූහය විවෘත්ත කිරීම සදහා...*
🐼𝗨𝗦𝗘 ➠ .group 

✨𝗫𝗢𝗠𝗠𝗔𝗡𝗖 ➠ *.tagall*
🪀𝗖.𝗫.𝗦 ➠ *සමූහයේ පුද්ගලයන් සියල්ල ටැග් කිරීමට...*
🐼𝗨𝗦𝗘 ➠ .tagall 
============================`}
let file = require.resolve(__filename)
fs.watchFile(file, () => {
	fs.unwatchFile(file)
	console.log(chalk.redBright(`Update ${__filename}`))
	delete require.cache[file]
	require(file)
})
